In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import optimize

In [2]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.date_range("20210306", periods=7)

DatetimeIndex(['2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12'],
              dtype='datetime64[ns]', freq='D')

In [4]:
pd.DataFrame(np.array([[1,2,3],[4,5,6]]), index=pd.date_range("20210306",periods=2),columns=list("ABC"))

            A  B  C
2021-03-06  1  2  3
2021-03-07  4  5  6

# Remeber that in Pandas, Data is indexed! Remember: Index is very important!

# Index is like primary key, because we can use join() to join same index

# loc gets rows (or columns) with particular labels from the index. iloc gets rows (or columns) at particular positions in the index (so it only takes integers)

In [5]:
dt = pd.DataFrame({
    "A": np.array([1, 2, 3]),
    "B": pd.Timestamp("2021-03-06"),
    "C": pd.Categorical(["car", "bus", "bike"]),
    "D": 1.5
})
dt

   A          B     C    D
0  1 2021-03-06   car  1.5
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [6]:
dt.head()

   A          B     C    D
0  1 2021-03-06   car  1.5
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [7]:
dt.tail(2)

   A          B     C    D
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [8]:
dt.describe()

         A    D
count  3.0  3.0
mean   2.0  1.5
std    1.0  0.0
min    1.0  1.5
25%    1.5  1.5
50%    2.0  1.5
75%    2.5  1.5
max    3.0  1.5

In [23]:
dt.A.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: A, dtype: float64

In [9]:
dt['B']

0   2021-03-06
1   2021-03-06
2   2021-03-06
Name: B, dtype: datetime64[ns]

In [10]:
dt[1:2]

   A          B    C    D
1  2 2021-03-06  bus  1.5

In [11]:
dt['C'] == 'car'

0     True
1    False
2    False
Name: C, dtype: bool

In [12]:
dt[dt['C'] == 'car']

   A          B    C    D
0  1 2021-03-06  car  1.5

In [51]:
w = pd.DataFrame(index=range(0, 10), columns=['x', 'y'])
w.loc[3] = [20, 30]
w

     x    y
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3   20   30
4  NaN  NaN
5  NaN  NaN
6  NaN  NaN
7  NaN  NaN
8  NaN  NaN
9  NaN  NaN

In [14]:
pd.Series([
'4 cups', '1 cup', '2 large', '1 can'
], index=[
'Flour', 'Milk', 'Eggs', 'Spam'
], name='Dinner')

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [ ]:
# pd.read_csv('../input/wine-reviews/winemag-data_first150k.csv',index_col=0)

# pd.read_csv('../input/wine-reviews/winemag-data_first150k.csv')

In [16]:
q=pd.DataFrame(np.arange(1,10).reshape(3,3), columns=list('ABC'))
q

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
# use q['A'] to select columns
# use q.loc and q.iloc to select rows
q[['A', 'C']]

   A  C
0  1  3
1  4  6
2  7  9

In [18]:
q.loc[0:1]

   A  B  C
0  1  2  3
1  4  5  6

In [19]:
q.loc[[0,2]]

   A  B  C
0  1  2  3
2  7  8  9

In [22]:
# use & and | to combine conditions
q.loc[(q.A == 1) | (q.B == 8)]

   A  B  C
0  1  2  3
2  7  8  9

In [26]:
randomized = q.sample(frac=1)
randomized.reset_index(inplace=True, drop=True)
randomized

   A  B  C
0  4  5  6
1  7  8  9
2  1  2  3

In [27]:
q.A.map(lambda x: x * 2)

0     2
1     8
2    14
Name: A, dtype: int64

In [30]:
def to_apply(row):
    row.B = row.B * 2
    return row

q.apply(to_apply, axis='columns')

   A   B  C
0  1   4  3
1  4  10  6
2  7  16  9

In [31]:
q.A.unique()

array([1, 4, 7])

In [32]:
q.A.value_counts()

4    1
1    1
7    1
Name: A, dtype: int64

In [33]:
g = pd.DataFrame({
    'student': ['John', 'John', 'Sarah', 'Sarah', 'Joe', 'Joe'],
    'course': ['Math', 'Physics', 'Math', 'Physics', 'Math', 'Physics'],
    'grade': [20, 18, 19, 14, 17, 19]
})
g

  student   course  grade
0    John     Math     20
1    John  Physics     18
2   Sarah     Math     19
3   Sarah  Physics     14
4     Joe     Math     17
5     Joe  Physics     19

In [36]:
g.groupby(['course']).count()

         student  grade
course
Math           3      3
Physics        3      3

In [40]:
g.groupby(['course']).grade.min()

course
Math       17
Physics    14
Name: grade, dtype: int64

In [43]:
g.groupby(['course']).grade.agg([max, min])

         max  min
course
Math      20   17
Physics   19   14

In [44]:
g.groupby('course').grade.agg([max, min]).sort_values(by='min')

         max  min
course
Physics   19   14
Math      20   17

In [46]:
temp = g.groupby('course').grade.agg([max, min])
temp.sort_values(by='min', inplace=True)
temp

         max  min
course
Physics   19   14
Math      20   17

In [47]:
g.grade.dtype

dtype('int64')

In [48]:
g.dtypes

student    object
course     object
grade       int64
dtype: object

In [55]:
w[~pd.isnull(w.x)]

    x   y
3  20  30

In [56]:
w.fillna('unknown')

         x        y
0  unknown  unknown
1  unknown  unknown
2  unknown  unknown
3       20       30
4  unknown  unknown
5  unknown  unknown
6  unknown  unknown
7  unknown  unknown
8  unknown  unknown
9  unknown  unknown

In [57]:
g.replace('John', 'Matthew')

   student   course  grade
0  Matthew     Math     20
1  Matthew  Physics     18
2    Sarah     Math     19
3    Sarah  Physics     14
4      Joe     Math     17
5      Joe  Physics     19

In [58]:
g.rename(columns={'student': 'name'})

    name   course  grade
0   John     Math     20
1   John  Physics     18
2  Sarah     Math     19
3  Sarah  Physics     14
4    Joe     Math     17
5    Joe  Physics     19

In [67]:
x=pd.DataFrame({
    'x': [10, 20],
    'y': [30, 40],
}, index=['A', 'B'])
x

    x   y
A  10  30
B  20  40

In [68]:
x.rename(index={'A': 'a'})

    x   y
a  10  30
B  20  40

In [70]:
x.rename_axis('winter', axis=0).rename_axis('summer', axis=1)

summer   x   y
winter
A       10  30
B       20  40

In [78]:
gg=g.set_index(['student', 'course'])
gg

                 grade
student course
John    Math        20
        Physics     18
Sarah   Math        19
        Physics     14
Joe     Math        17
        Physics     19

In [82]:
gg.loc['John', 'Math']

grade    20
Name: (John, Math), dtype: int64

In [83]:
gg.iloc[0]

grade    20
Name: (John, Math), dtype: int64

In [87]:
y = pd.DataFrame({
    'student': ['John', 'John', 'Sarah', 'Sarah', 'Joe', 'Joe'],
    'course': ['Math', 'Physics', 'Math', 'Physics', 'Math', 'Physics'],
    'project_score': [16,10,12,18,20,19]
})
y=y.set_index(['student', 'course'])

gg.join(y)

                 grade  project_score
student course
John    Math        20             16
        Physics     18             10
Sarah   Math        19             12
        Physics     14             18
Joe     Math        17             20
        Physics     19             19